---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  I:\nick\code\pesticide-use-toxicity\interpolation.log
  log type:  text
 opened on:  17 Mar 2015, 13:30:33

. 
. * load the chemical use data and save to a tempfile
. insheet using "data/chemical_use_ipol.csv"
(14 vars, 115805 obs)

. keep state year crop lbs_applied lbs_per_acre_app lbs_per_acre_yr num_apps pct_area_treated chemical_name chemical_type chemical_id

. tempfile chemical_use

. save "`chemical_use'", replace
(note: file C:\Users\POTTER~1\AppData\Local\Temp\ST_02000002.tmp not found)
file C:\Users\POTTER~1\AppData\Local\Temp\ST_02000002.tmp saved

. 
. * load the acres data
. clear

. insheet using "data/acres_clean.csv"
(13 vars, 10734 obs)

. keep year crop state acres

. 
. * merge the year and value data to the categorical data
. merge 1:m crop state year using "`chemical_use'"

    Result                           # of obs.
    -----------------------------------------
    not matched                        10,343
        from master                     8,894  (_merge==1)
        from using                      1,449  (_merge==2)

    matched                           114,356  (_merge==3)
    -----------------------------------------

. 
. *check merge
. tab _merge

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |      8,894        7.13        7.13
         using only (2) |      1,449        1.16        8.29
            matched (3) |    114,356       91.71      100.00
------------------------+-----------------------------------
                  Total |    124,699      100.00

. keep if _merge!=1
(8894 observations deleted)

. drop _merge

. 
. *generate lbs per acre
. gen lbs_per_acre = lbs_applied / acres
(66298 missing values generated)

. 
. * remove spaces...
. replace crop = trim(crop)
(115805 real changes made)

. replace chemical_name = trim(chemical_name)
(0 real changes made)

. 
. *save the data
. sort crop state year chemical_name

. save "data/use_acres_merged.dta", replace
file data/use_acres_merged.dta saved

. 
. *close log
. log close
      name:  <unnamed>
       log:  I:\nick\code\pesticide-use-toxicity\interpolation.log
  log type:  text
 closed on:  17 Mar 2015, 13:30:35
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
