---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  I:\nick\code\pesticide-use-toxicity\interpolation.log
  log type:  text
 opened on:  26 Feb 2015, 15:38:46

. 
. * load the chemical use data and save to a tempfile
. insheet using "data/chemical_use_ipol.csv"
(18 vars, 96278 obs)

. keep state year crop ivalue measure chemical_name chemical_type chemical_id

. keep if measure=="APPLICATIONS"
(83329 observations deleted)

. drop measure

. rename ivalue appl_lbs

. tempfile chemical_use

. save "`chemical_use'", replace
(note: file C:\Users\POTTER~1\AppData\Local\Temp\ST_01000005.tmp not found)
file C:\Users\POTTER~1\AppData\Local\Temp\ST_01000005.tmp saved

. 
. * load the acres data
. clear

. insheet using "data/acres_clean.csv"
(13 vars, 9986 obs)

. keep year crop state acres

. 
. * merge the year and value data to the categorical data
. merge 1:m crop state year using "`chemical_use'"

    Result                           # of obs.
    -----------------------------------------
    not matched                         8,698
        from master                     8,698  (_merge==1)
        from using                          0  (_merge==2)

    matched                            12,949  (_merge==3)
    -----------------------------------------

. 
. *check merge
. tab _merge

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |      8,698       40.18       40.18
            matched (3) |     12,949       59.82      100.00
------------------------+-----------------------------------
                  Total |     21,647      100.00

. keep if _merge!=1
(8698 observations deleted)

. drop _merge

. 
. *generate lbs per acre
. gen lbs_per_acre = appl_lbs / acres
(5539 missing values generated)

. 
. *save the data
. sort crop state year chemical_name

. save "data/use_acres_merged.dta", replace
file data/use_acres_merged.dta saved

. 
. *close log
. log close
      name:  <unnamed>
       log:  I:\nick\code\pesticide-use-toxicity\interpolation.log
  log type:  text
 closed on:  26 Feb 2015, 15:38:47
---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
